// написать программу для, которая из имеющегосч массива строк,
// длина которых меньше, либо равна 3 символам. Первоначальный 
// массив строк задается с клавиатуры, либо задается вначале.

Console.Clear();

string [] array = {"2", "women", "get", "table"};
Console.WriteLine(array);

